[
  {
    "user_id": "83492017",
    "content": "still have that desire to be wanted so deeply ingrained inside of me and it’s so painful. and the way it works is shitty bc the more of that you have, the less chance there is of it being alleviated.\n\neven though it’s not so bad anymore, i think some small part of this feeling of not being enough will always exist in me. but i will not let it turn me into a monster",
    "post_id": null,
    "comment_id": "9472015834",
    "topic_tags": [
      "Mental health history",
      "Views on men/masculinity",
      "Dating history",
      "Sexuality"
    ],
    "timestamp": "2025-11-30T11:45:22Z"
  },
  {
    "user_id": "52918403",
    "content": "Honestly, you’re not broken or doomed, you just sound like a 20 year old who’s stuck in their own head and confusing insecurity for truth. A lot of what you’re feeling (loneliness, overthinking, hating your appearance, wondering if you’ll ever be loved) is way more common than you think, it’s just that most people hide it as well as you do. The key right now isn’t “give up on girls” or “only date guys,” it’s getting out of the mindset that you need to be objectively hot or effortlessly social to be wanted. Keep working on your confidence, style, and social comfort the same way you’d level up in a game, small, consistent moves. Say yes to low pressure hangs, practice being warm even when it feels awkward, and don’t be afraid to date whoever actually shows interest and makes you feel good.",
    "post_id": null,
    "comment_id": "3085219440",
    "topic_tags": [
      "Mental health history",
      "Views on men/masculinity",
      "Dating history",
      "Sexuality",
      "Friendship history"
    ],
    "timestamp": "2025-11-30T12:15:42Z"
  },
  {
    "user_id": "40391258",
    "content": "I’m just gonna say that going down this path is going to make all of the things that are already difficult for you to achieve waaaay harder. It is not going to help you. Will you achieve a sense of community? Sure, but on that note, I could go find a toxic ass man on the street and make him my bf and give myself a life of misery just to not be alone. I could do it, but I would be miserable. I like being on my own, even though I do believe I’ll find my person when the time is right.\n\nI think it could be helpful to find activities you enjoy, preferably ones that require you to go out into the community (or ones with online communities) and create a routine that makes you happy! It is so important to enjoy being in your own company. It protects you from devaluing yourself which I believe makes it easier to be manipulated or settle for bullshit in relationships. You’re worth more than that.",
    "post_id": null,
    "comment_id": "8821945503",
    "topic_tags": [
      "Views on women",
      "Views on men/masculinity",
      "Mental health history",
      "Dating history",
      "Friendship history"
    ],
    "timestamp": "2025-11-30T12:41:03Z"
  },
  {
    "user_id": "61038294",
    "content": "as a veteran in self-isolating, i want to remind you that you can't just get better momentarily. improvement is a difficult thing to do, and everyone will experience many failures. don't punish yourself too much (or maybe don't punish yourself at all), but create \"safety measures\" instead. plan what you'll do when things don't go right. for example, \"if i get caught up scrolling, I'll stop and go wash dishes/finish the rest of my schedule\". you are very very young still. it's okay to have limited experience.",
    "post_id": null,
    "comment_id": "7021938844",
    "topic_tags": [
      "Mental health history",
      "Friendship history"
    ],
    "timestamp": "2025-11-30T13:06:51Z"
  },
  {
    "user_id": "28491052",
    "content": "It's really important that you can recognize that you're in this situation because you spent a lot of time taking the easy way out. It's risky to put yourself out there. There are a lot of negative emotions that can come from it. Anxiety from meeting new people or trying new things. Fear of being rejected, sadness if you are rejected. It's way easier and more comfortable to not even try, because if you don't try then you won't feel those things. But you won't feel the good things either. The camaraderie that comes from having a diverse group of good friends. The joy that comes from making a connection with someone. The intimacy of trust and openness. Do all of those things come with potential pain? Absolutely. But you're robbing yourself of so much just because you're playing it safe.",
    "post_id": null,
    "comment_id": "7740195581",
    "topic_tags": [
      "Mental health history",
      "Friendship history",
      "Dating history"
    ],
    "timestamp": "2025-11-30T13:15:44Z"
  },
  {
    "user_id": "39810224",
    "content": "Look here's the hard truth: we're probably never going to achieve some sort of societal nirvana in which men who are sexually successful are looked at as absolutely no different than men who are sexually unsuccessful.\n\nA phrase I always love is 'wish in one hand, shit in the other: let me know what fills up first'. So if society is never going to change, then there's no point in worrying about it. You just have to keep doing the best you can and keep trying.",
    "post_id": null,
    "comment_id": "9031048851",
    "topic_tags": [
      "Views on men/masculinity",
      "Sexual history (virginity)",
      "Dating history",
      "Mental health history"
    ],
    "timestamp": "2025-11-30T13:58:12Z"
  },
  {
    "user_id": "64401892",
    "content": "I wouldn't say people care or don't care. In fact, I really don't like people framing social anxiety (or any anxiety) as \"the fear of someone always caring too much or thinking about you constantly\". If anything, it's more about the fear of unfair judgement, and using that judgement to further reject, bully, mock us, or even get others to do the same.\n\nBut yeah I agree about \"most people don't care that much, or are thinking about you constantly. Some may judge you though, whether it's justified or not\"",
    "post_id": null,
    "comment_id": "8822041199",
    "topic_tags": [
      "Mental health history",
      "Friendship history",
      "Views on men/masculinity",
      "Sexual history (virginity)",
      "Dating history"
    ],
    "timestamp": "2025-11-30T14:22:51Z"
  },
  {
    "user_id": "59381044",
    "content": "I suppose I'd just like to say welcome to a healthier way of viewing life, relationships and yourself! Honestly a lot of the healing is just patience in the process. The constant scanning to see what might be wrong with you is actually part of what sustains the incel mindset in my opinion. Knowing that you want to work towards a more stable way of viewing the world and being less angry/negative is the hardest part. The beliefs that incels typically hold are ironically the thing that keeps them feeling miserable.\n\nSo yeah you understanding that not every touch or hug or interaction is inherently an attack on you is the biggest hurdle so i congratulate you. Now you have the orientation so it's just about learning emotional maturity, practicing mindfulness and emotional regulation. When you have a thought try to step outside yourself for a moment and ask, is this belief I'm entertaining making me angry, more upset or activated? If I act on this belief in front of others, are they going to see me as kind and warm or defensive and narrow?\n\nTrust your own growth, try not to rush yourself. Trusting that you are going exactly the right pace will help you stay present and in a posture to learn every day. You're on a magic carpet ride of life now and what helps me is realizing that this is my life and I get to live according to my values, not what others say I should value. Above all remember that each person you encounter is on as complex a journey as you are. This will give you patience and love for others. Proud of you OP.",
    "post_id": null,
    "comment_id": "8802147765",
    "topic_tags": [
      "Mental health history",
      "Views on men/masculinity",
      "Dating history"
    ],
    "timestamp": "2025-11-30T15:05:47Z"
  },
  {
    "user_id": "53001892",
    "content": "I understand your stance in this. I thought like that for a very long time, that I should first work on myself and love myself to then look for a relationship. I am not suggesting that you should change your outlook, but only talking about my situation. I think I eventually realized that part of \"working on myself\" included being in a relationship and learning through it. There are aspects of maturity that I believe I develop through a relationship and not anywhere else, be it meditation, therapy, raising my income or reading books. It's akin to your career. You won't ever manage to be good enough in your field without making many, many mistakes. People know you will make mistakes and expect you to. You only need to find those kind people who are willing to help you through the first steps.",
    "post_id": null,
    "comment_id": "6629185501",
    "topic_tags": [
      "Dating history",
      "Mental health history",
      "Views on men/masculinity"
    ],
    "timestamp": "2025-11-30T15:19:12Z"
  },
  {
    "user_id": "41928033",
    "content": "Well you're being way too hard on yourself for one lol. Give yourself a break.\n\nI guess step 1 is stop calling yourself an incel (assuming you do). It's not an objective descriptor, its a made-up identity. You don't follow the incel mindset and you don't like their weird memes. You're \"not like other incels\" like a duck is not like a bunch of cats.\n\nI guess my number one advice would be: ok, you're looking for a job? Good. Focus on that. Yes, work out and do skin care or whatever, but even that's to help. This is advice I'm increasingly focusing on because all the fucking recession indicators I'm seeing, but also because its just a good thing to focus on that can build your confidence, skills, idea of yourself, and eventually your bank account.",
    "post_id": null,
    "comment_id": "7721900441",
    "topic_tags": [
      "Mental health history",
      "Views on men/masculinity",
      "Job history"
    ],
    "timestamp": "2025-11-30T15:32:59Z"
  },
  {
    "user_id": "61294028",
    "content": "“Life’s better when you’re actually living it”. Couldn’t have said it better myself! Well done, man! Glad you’re enjoying the ride! People forget sometimes how fun it is to hang out with and meet new people. Yes some are total douchenozzles, but there’s some amazingly fun and funny people out there too.",
    "post_id": null,
    "comment_id": "9930146722",
    "topic_tags": [
      "Friendship history",
      "Mental health history",
      "Views on men/masculinity"
    ],
    "timestamp": "2025-11-30T15:55:14Z"
  },
  {
    "user_id": "51822091",
    "content": "How muscular do I need to get. Im not fat right now by any metric, but im not ripped either. I've been trying to exsersize at home and outside. Ive also started doing kickboxing. I just really don't like exserizing indoors with a bunch of people judging my body and having to ask questions. Beginning things is terrifying.",
    "post_id": null,
    "comment_id": "6678201940",
    "topic_tags": [
      "Mental health history",
      "Views on men/masculinity",
      "Friendship history"
    ],
    "timestamp": "2025-11-30T16:07:28Z"
  },
  {
    "user_id": "47219034",
    "content": "This is amazing, give yourself huge credit for huge steps. ✨ There may be slower or lower days sometimes, but you know now how far up it can go again. And every time, the baseline for your everyday feelings and motivation will keep inching up. Bad days will be exceptions.",
    "post_id": null,
    "comment_id": "7710922044",
    "topic_tags": [
      "Mental health history",
      "Friendship history"
    ],
    "timestamp": "2025-11-30T16:23:41Z"
  },
  {
    "user_id": "58102944",
    "content": "Dude, that is a LOT of stuff. Awesome! Keeping busy, having hobbies, even causes, is one of the best fixes for feeling anxious and too much in your own problems. Creating and doing and helping, that’s where it’s at.",
    "post_id": null,
    "comment_id": "5521900440",
    "topic_tags": [
      "Mental health history",
      "Friendship history"
    ],
    "timestamp": "2025-11-30T16:30:58Z"
  },
  {
    "user_id": "52990144",
    "content": "Can you give me your brutally honest opinion on how much evidence the claim below has? Like its okay if you aren't idealistic and you feel like there is a harsh truth. Lets actually evaluate if this claim is actually true.\n\n\"My height (5'8\"), being East Asian, and my looks make me undesirable which will cause me to never get into a relationship where she is authentically attracted to me.\"",
    "post_id": null,
    "comment_id": "8851204920",
    "topic_tags": [
      "Race",
      "Views on men/masculinity",
      "Mental health history",
      "Dating history"
    ],
    "timestamp": "2025-11-30T16:47:55Z"
  },
  {
    "user_id": "69420115",
    "content": "> The height issue isn’t that big of a deal though, since I see a lot of men at my workplace in relationships and they aren’t rich or handsome either.\n\nAnd I see plenty of Asian guys in relationships too. Simply getting out of the incel internet bubble and meeting people in real life is the best counter-argument to incel beliefs.\n\n> Stuff like my height (5'8\"), being East Asian, or my looks making me “undesirable,”\n\nThe average height in the US is 5'9 so your height of 5'8 is in the average range and isn't considered short. I know you aren't certain of this, but what is the case of a 5'8 height making you undesirable to all women?\n\nhttps://www.health.com/average-height-for-men-7501601\n\nhttps://www.huffpost.com/entry/okcupid-race_n_5811840\n\nhttps://home.uchicago.edu/~hortacsu/onlinedating.pdf\n\nTwo problems here:\n\n1. Even these stats how that Asian men don't have zero success or results on online dating, just reduced results on average. This conflicts with the claim that \"I’m not good enough and never will be for anybody.\"\n2. The standard deviation should be taken into account because very few individuals reflect the absolute average.\n3. The vast majority of people aren't online dating experts and certainly aren't dating optimally in general. So these statistics don't show nothing you will do will ever work.\n4. Dating apps are 75% men and text on a screen lacks that in person connection. As a result competition among men is very fierce and pics and looks have disproportionate importance. Incel arguments often assume all dating is online dating which is categorically false.\n5. These sources don't actually directly show that a high proportion of asian men are long term single and never get into a relationship. I haven't found a single study that proves this.",
    "post_id": null,
    "comment_id": "9033108841",
    "topic_tags": [
      "Race",
      "Views on men/masculinity",
      "Dating history",
      "Mental health history"
    ],
    "timestamp": "2025-11-30T17:02:48Z"
  },
  {
    "user_id": "58491022",
    "content": "Okay, no advice, I am here to validate. Dating right now is fucking HARD. I have several close friends who are actively trying to date and you are absolutely not alone in your experience of getting ghosted and having multiple short term successes that suddenly end.\n\nThe friends I have who are dating right now are both men and women, both have professional careers, lots of friends, and active social lives and they are reporting the same things. They say they are tired and drained from the process.\n\nI am glad you came to the sub to vent. Truly, no advice as the things you've said show that you're on the right track. The fact you have platonic friends across the gender spectrum is a big green flag. It truly is hard and you are very valid to feel frustrated, worn out, and disappointed. I hope that you're able to keep the awareness that this not a reflection on you as an individual. Even though it feels so very personal. Keep up the good work, try to enjoy life, and I am sending all the good hopes your way that you find the connection(s) you are looking for.",
    "post_id": null,
    "comment_id": "7712049944",
    "topic_tags": [
      "Dating history",
      "Mental health history",
      "Friendship history"
    ],
    "timestamp": "2025-11-30T17:20:55Z"
  },
  {
    "user_id": "91028471",
    "content": "I grew up in a pretty religious household, and for a long time I thought God was punishing me for not being in a relationship yet. Therapy helped me separate my faith from my dating life. You can still be spiritual and also accept that sometimes it’s just bad luck, timing, and patterns you can work on.",
    "post_id": "post_018",
    "comment_id": null,
    "topic_tags": [
      "Religion",
      "Mental health history",
      "Dating history"
    ],
    "timestamp": "2025-11-30T18:00:12Z"
  },
  {
    "user_id": "77291034",
    "content": "For me, religion actually made it harder to figure out my sexuality. I kept thinking any desire was ‘wrong’. Only when I met people at a progressive church did I realise you can be queer, straight, confused, whatever, and still be a decent person who deserves love like anyone else.",
    "post_id": "post_019",
    "comment_id": null,
    "topic_tags": [
      "Religion",
      "Sexuality",
      "Mental health history"
    ],
    "timestamp": "2025-11-30T18:06:45Z"
  },
  {
    "user_id": "63840291",
    "content": "I didn’t date at all during high school or uni because I was so focused on grades. Now I’ve finished my degree and started my first job, I’m realising that my education history doesn’t automatically translate into social skills. I’m basically learning dating the way I once learned exam material—slowly and with practice.",
    "post_id": "post_020",
    "comment_id": null,
    "topic_tags": [
      "Education history",
      "Job history",
      "Dating history",
      "Mental health history"
    ],
    "timestamp": "2025-11-30T18:13:30Z"
  },
  {
    "user_id": "51092834",
    "content": "I moved countries for university, and the location change absolutely wrecked my social confidence at first. New language, new norms, new dating culture. It took a couple of years before I stopped comparing everything to my home country and started building actual friendships here.",
    "post_id": "post_021",
    "comment_id": null,
    "topic_tags": [
      "Location",
      "Education history",
      "Friendship history",
      "Mental health history"
    ],
    "timestamp": "2025-11-30T18:19:54Z"
  },
  {
    "user_id": "42019385",
    "content": "As a Black guy living in a mostly white town, race definitely shows up in my dating life. Some people fetishise me, others avoid me. But it’s not the whole story. I’ve also had genuinely kind partners who saw me as a person first. Race matters, but it’s not the only variable in whether someone can care about you.",
    "post_id": "post_022",
    "comment_id": null,
    "topic_tags": [
      "Race",
      "Location",
      "Dating history",
      "Views on men/masculinity"
    ],
    "timestamp": "2025-11-30T18:26:18Z"
  },
  {
    "user_id": "59380112",
    "content": "I stayed a virgin into my late 20s, and the funniest part is that once I stopped treating it like a catastrophe, it became so much easier to be intimate with someone. My partner genuinely didn’t care that I had no ‘experience’. What they cared about was whether I listened, respected boundaries, and communicated.",
    "post_id": "post_023",
    "comment_id": null,
    "topic_tags": [
      "Sexual history (virginity)",
      "Mental health history",
      "Dating history"
    ],
    "timestamp": "2025-11-30T18:33:02Z"
  },
  {
    "user_id": "30291844",
    "content": "Sexuality took me a long time to unpack. For years I called myself straight because that felt ‘simpler’, but my actual experiences never fit neatly. Giving myself permission to experiment and admit I was bi made my dating life less tortured and more honest, even if it didn’t magically fix everything.",
    "post_id": "post_024",
    "comment_id": null,
    "topic_tags": [
      "Sexuality",
      "Dating history",
      "Mental health history"
    ],
    "timestamp": "2025-11-30T18:39:37Z"
  },
  {
    "user_id": "81920455",
    "content": "I used to think women were all ‘shallow’ because they didn’t want me, but once I actually got close female friends, my views on women changed a lot. Most of them are just navigating their own fears, trauma, and safety concerns. Seeing them as full people instead of judges sitting on a panel helped my mental health a ton.",
    "post_id": "post_025",
    "comment_id": null,
    "topic_tags": [
      "Views on women",
      "Friendship history",
      "Mental health history"
    ],
    "timestamp": "2025-11-30T18:46:11Z"
  },
  {
    "user_id": "78104429",
    "content": "I didn’t have my first kiss until 26, and I’d built it up so much in my head that I was shaking. The reality was awkward and sweet and very human. Being a late bloomer sexually doesn’t disqualify you from relationships; it just means your timeline is different from whatever fake ‘normal’ you see online.",
    "post_id": "post_026",
    "comment_id": null,
    "topic_tags": [
      "Sexual history (virginity)",
      "Dating history",
      "Mental health history"
    ],
    "timestamp": "2025-11-30T18:52:40Z"
  },
  {
    "user_id": "69021477",
    "content": "Losing my job hit my self-esteem way harder than any breakup. I felt like I had no right to date while unemployed. But when I eventually told someone I was seeing what was going on, they were way more understanding than I expected. Job history isn’t a moral scorecard, even if capitalism makes it feel that way.",
    "post_id": "post_027",
    "comment_id": null,
    "topic_tags": [
      "Job history",
      "Mental health history",
      "Dating history"
    ],
    "timestamp": "2025-11-30T18:59:03Z"
  },
  {
    "user_id": "55290113",
    "content": "School was rough for me socially. I was the quiet kid with good grades and no clue how to flirt. Looking back, my education history explains some of my awkwardness, but it doesn’t doom my future. I’ve been treating social skills like a class I never got to take, and I’m finally catching up in my 20s.",
    "post_id": "post_028",
    "comment_id": null,
    "topic_tags": [
      "Education history",
      "Friendship history",
      "Mental health history"
    ],
    "timestamp": "2025-11-30T19:05:26Z"
  },
  {
    "user_id": "74401922",
    "content": "Moving back in with my parents for a while changed my dating life a lot. In my culture, it’s normal at this age, but where I live now people see it as a red flag. Location and culture shape expectations more than we think, so I’ve started explaining the context instead of assuming people will magically understand.",
    "post_id": "post_029",
    "comment_id": null,
    "topic_tags": [
      "Location",
      "Race",
      "Dating history",
      "Mental health history"
    ],
    "timestamp": "2025-11-30T19:12:41Z"
  }
]